distribution/scripts/jmeter/requests/500B_buyStocks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body>
<m:buyStocks xmlns:m="http://services.samples/xsd">
<order><symbol>IBM</symbol><buyerID>dushan</buyerID><price>140.34</price><volume>200000</volume></order>
<order><symbol>MSFT</symbol><buyerID>kasun</buyerID><price>23.56</price><volume>8030000</volume></order>
</m:buyStocks>
</soapenv:Body>
</soapenv:Envelope>
