distribution/scripts/jmeter/requests/50Elements_buyStocks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body><m:buyStocks xmlns:m="http://services.samples/xsd">
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>50</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>49</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>48</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>47</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>46</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>45</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>44</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>43</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>42</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>41</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>40</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>39</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>38</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>37</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>36</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>35</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>34</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>33</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>32</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>31</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>30</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>29</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>28</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>27</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>26</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>25</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>24</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>23</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>22</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>21</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>20</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>19</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>18</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>17</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>16</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>15</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>14</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>13</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>12</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>11</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>10</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>9</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>8</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>7</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>6</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>5</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>4</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>3</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>2</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>1</volume></order>
</m:buyStocks></soapenv:Body></soapenv:Envelope>
