distribution/scripts/jmeter/requests/5Elements_buyStocks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body><m:buyStocks xmlns:m="http://services.samples/xsd">
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>5</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>4</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>3</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>2</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>1</volume></order>
</m:buyStocks></soapenv:Body></soapenv:Envelope>
